<template><div><h1 id="游玩须知" tabindex="-1"><a class="header-anchor" href="#游玩须知"><span>游玩须知</span></a></h1>
<p>服务器定位<strong>社会模拟</strong>主题，<strong>存在竞争、互相争夺</strong>的玩法，因此不适合作为纯粹的囤物生存的玩家。</p>
<p>玩家互相出现摩擦、掠夺对方资源的情况是可能的，服务器没有限制以上或者将会出现的任何竞争行为，在<strong>没有作弊的前提下</strong>是允许的（作弊由管理员裁决）。</p>
<p>建设组只负责玩法实现，实际功能是插件提供的，因此<strong>难免存在bug</strong>，若您有解决的意愿请在群组中反馈，但借此出现攻击、谩骂管理员等行为将会被踢出服务器。</p>
<p>游玩服务器以此文件+群组公告为准，管理员的任何建议或解答只作为参考，不保证准确性，钻牛角尖问题恕不回答，如您愿补充词条可私聊管理员审核开放编辑文档权限。</p>
<hr>
<h2 id="管理规章" tabindex="-1"><a class="header-anchor" href="#管理规章"><span>管理规章</span></a></h2>
<h3 id="管理组" tabindex="-1"><a class="header-anchor" href="#管理组"><span>管理组</span></a></h3>
<p>SimpleWorld采取分区管理，各位置拥有对应区域的小管理，任何管理不允许使用权限给服务器玩家提供任何便利，经检举并证实后，视影响受到撤职或踢出服务器等程度处罚。</p>
<h3 id="游戏发言" tabindex="-1"><a class="header-anchor" href="#游戏发言"><span>游戏发言</span></a></h3>
<p>SimpleWorld定位是社会模拟服，一定存在玩家之间的摩擦，管理组不参与玩家团体之间的沟通。</p>
<p>为防止出现违法乱纪，影响服务器发展或造成玩家流失等行为出现，管理组将提前在涉及到以上行为的沟通中介入，并对涉及的玩家进行禁言处理。</p>
<p>因存在城镇玩法，各组织（国家/城镇）成员应谨慎邀请人员加入，并做好权限分配，以防出现内奸造成自己国家损失。</p>
<p>关于小号问题，服务器允许同一IP注册2个账号，玩家登录时管理员能查看到玩家所拥有的所有账号，各位使用小号玩家谨慎发言。</p>
</div></template>


