<template><div><h2 id="小屋资源点" tabindex="-1"><a class="header-anchor" href="#小屋资源点"><span>小屋资源点</span></a></h2>
<p>SW小屋资源点：玩家获取稀缺/限制资源的地点。</p>
<p>主要种类：附魔金苹果、附魔、炼药、经验瓶、SW银行、末影珍珠、潜影壳、魔法道具合成物。</p>
<p>次要种类：建材、铁轨。</p>
<p>小屋资源点分为简易（lite）、高级（pro）两个版本。</p>
<p>同种小屋简易和高级版本获取的资源一样，仅是一次性能获取的数量/效果不同。</p>
<p>小屋的投放规则跟随城镇发展，每种小屋跟随城镇/国家所在地洲生成，且存在种类互斥。（见下文）</p>
<h3 id="各小屋版本规格说明" tabindex="-1"><a class="header-anchor" href="#各小屋版本规格说明"><span>各小屋版本规格说明</span></a></h3>
<table>
<thead>
<tr>
<th>名称</th>
<th>高级（pro）</th>
<th>简易（lite）</th>
</tr>
</thead>
<tbody>
<tr>
<td>附魔小屋</td>
<td>满级附魔</td>
<td>16级附魔</td>
</tr>
<tr>
<td>炼药小屋</td>
<td>1红石炼药台+2普通炼药台</td>
<td>单炼药台</td>
</tr>
<tr>
<td>经验小屋</td>
<td>购买额 3组经验瓶/3小时/每人</td>
<td>购买额 1组经验瓶/4小时/每人</td>
</tr>
<tr>
<td>金苹果小屋</td>
<td>购买额 5个/3小时/每人</td>
<td>购买额 2个/5小时/每人</td>
</tr>
<tr>
<td>SW银行</td>
<td>35SW币/1小时/每人</td>
<td>10SW币/1小时/每人</td>
</tr>
<tr>
<td>末影珍珠</td>
<td>购买额 15个/2小时/每人</td>
<td>购买额 3个/2小时/每人</td>
</tr>
<tr>
<td>潜影壳</td>
<td>购买额 16个/3小时/每人</td>
<td>购买额 2个/3小时/每人</td>
</tr>
<tr>
<td>魔法道具</td>
<td>魔能碎片 1个/5小时/每人</td>
<td>魔能碎片 1个/10小时/每人</td>
</tr>
<tr>
<td>铁轨</td>
<td>购买额 1组/3小时/每人</td>
<td>购买额 12个/3小时/每人</td>
</tr>
<tr>
<td>建材（三石）</td>
<td>购买额 10组/1小时/每人</td>
<td>购买额 6组/1小时/每人</td>
</tr>
</tbody>
</table>
<h3 id="互斥规则-仅主要种类存在互斥-互斥类型同一国家-城镇无法拥有" tabindex="-1"><a class="header-anchor" href="#互斥规则-仅主要种类存在互斥-互斥类型同一国家-城镇无法拥有"><span>互斥规则（仅主要种类存在互斥，互斥类型同一国家/城镇无法拥有）</span></a></h3>
<p>经验X附魔、末影珍珠X炼药X附魔金、潜影壳X炼药、SW银行X经验</p>
<h3 id="投放规则" tabindex="-1"><a class="header-anchor" href="#投放规则"><span>投放规则</span></a></h3>
<p>因认定地规则，玩家仅能<strong>自选当前城镇/国家认定地支持的小屋</strong>。
投放不区分主要、次要种类。</p>
<p>城镇的投放为城镇区域上。</p>
<p>国家的投放默认投入最多居民的地区，若投放至指定地区需国王自行协调，并且指定城镇人数至少等于3人。</p>
<p><strong>玩家需提前建造只有一个踏板门作为出入口的封闭小屋（材质不限），并需要关闭外来者开关权限，确保外人无法进入</strong></p>
<p>城镇：拥有<strong>3人的城镇支持投放1种简易版本</strong>小屋</p>
<p>拥有 3+3 人的城镇支持将原有小屋提升至高级 或 追加1种简易版本。</p>
<p><strong>每个非和平城镇最多拥有1高级+1简易小屋。</strong>
<strong>每个和平城镇最多拥有1简易+1简易小屋。</strong></p>
<p>当城镇附属于国家时，所有小屋资源点由国王协调，并且拥有规则自动升级为国家规则，但国家的单个城镇最多拥有（2个高级）。
（例：A王国拥有4个BCDE城镇，国王可将所有资源小屋均分，或只分给其中两个城镇）</p>
<p>国家：每拥有6 * X（X&gt;=1）人的国家支持投放1种高级小屋，原城镇已有高级则不投放新小屋
<strong>每个国家最多拥有4高级，2简易</strong></p>
<p>协调资源时间：仅支持每2周一次。</p>
<p><strong>小屋自觉维护，遭到玩家自主破坏后5天，服务器维护人员才重新投入</strong></p>
<h3 id="消失规则" tabindex="-1"><a class="header-anchor" href="#消失规则"><span>消失规则</span></a></h3>
<p>因存在城镇、国家倒闭机制，当居民流失一周后，SW服务器将收回小屋。</p>
<h3 id="惩罚机制" tabindex="-1"><a class="header-anchor" href="#惩罚机制"><span>惩罚机制</span></a></h3>
<p>SW<strong>不允许王国、城镇之间占领多余的、互斥的小屋，不允许其他城镇/国家使用本国小屋，仅可通过贸易交易小屋物资</strong></p>
<p>支持玩家检举，检举方式：发送证明截图并在群组中艾特管理员。</p>
<p>经查证属实后过分扩张的城镇/国家拥有的小屋归于检举者，若检举者所属城镇/国家拥有小屋已满，则每个高配小屋获得500SW币，每个简易版本获取250SW币奖励。</p>
<p><strong>外人使用小屋的情况（非本城镇居民，盟友算作外人）：</strong></p>
<p>1.主人自主检举：交互权限关闭后并无其他出入口，服务器拿出该使用者账户的300SW币（账户不足300SW会持续扣除直到赔偿完毕）补偿给所属城镇/国家 城主。</p>
<p>2.玩家检举：经查证后撤销该小屋，并且服务器不会再给该国家/城镇投放任何新小屋。</p>
<p>查证失败后，检举者将被惩罚分出个人账户150SW均摊分给在线玩家。</p>
</div></template>


